# Post University Salaries of Graduates by Major

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('salaries-by-college-major.csv')

In [3]:
df.head()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,41600.0,76800.0,50600.0,136000.0,Business

In [4]:
df.head(3)

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,42600.0,71900.0,36300.0,150000.0,Business

In [5]:
df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS
50,Source: PayScale Inc.,NaN,NaN,NaN,NaN,NaN

How many rows and columns does our dataframe have?

In [6]:
df.shape

(51, 6)

What are the labels for the columns? Do the columns have names?

In [7]:
df.columns

Index(['Undergraduate Major', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')

Are there any missing values in our dataframe? Does our dataframe contain any bad data?

In [8]:
df.isna().values.any()

True

In [9]:
df.isna().sum()

Undergraduate Major                  0
Starting Median Salary               1
Mid-Career Median Salary             1
Mid-Career 10th Percentile Salary    1
Mid-Career 90th Percentile Salary    1
Group                                1
dtype: int64

In [10]:
df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS
50,Source: PayScale Inc.,NaN,NaN,NaN,NaN,NaN

In [11]:
clean_df= df.dropna()

In [12]:
clean_df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
45,Political Science,40800.0,78200.0,41200.0,168000.0,HASS
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS

In [13]:
df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS
50,Source: PayScale Inc.,NaN,NaN,NaN,NaN,NaN

In [14]:
df.drop(50)

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,41600.0,76800.0,50600.0,136000.0,Business
5,Art History,35800.0,64900.0,28800.0,125000.0,HASS
6,Biology,38800.0,64800.0,36900.0,135000.0,STEM
7,Business Management,43000.0,72100.0,38800.0,147000.0,Business
8,Chemical Engineering,63200.0,107000.0,71900.0,194000.0,STEM
9,Chemistry,42600.0,79900.0,45300.0,148000.0,STEM
10,Civil Engineering,53900.0,90500.0,63400.0,148000.0,STEM
11,Communications,38100.0,70000.0,37500.0,143000.0,HASS
12,Computer Engineering,61400.0,105000.0,66100.0,162000.0,STEM
13,Computer Science,55900.0,95500.0,56000.0,154000.0,STEM
14,Construction,53700.0,88900.0,56300.0,171000.0,Business
15,Criminal Justice,35000.0,56300.0,32200.0,107000.0,HASS
16,Drama,35900.0,56900.0,36700.0,153000.0,HASS
17,Economics,50100.0,98600.0,50600.0,210000.0,Business
18,Education,34900.0,52000.0,29300.0,102000.0,HASS
19,Electrical Engineering,60900.0,103000.0,69300.0,168000.0,STEM
20,English,38000.0,64700.0,33400.0,133000.0,HASS
21,Film,37900.0,68500.0,33900.0,136000.0,HASS
22,Finance,47900.0,88300.0,47200.0,195000.0,Business
23,Forestry,39100.0,62600.0,41000.0,111000.0,Business
24,Geography,41200.0,65500.0,40000.0,132000.0,HASS
25,Geology,43500.0,79500.0,45000.0,156000.0,STEM
26,Graphic Design,35700.0,59800.0,36000.0,112000.0,HASS
27,Health Care Administration,38800.0,60600.0,34600.0,101000.0,Business
28,History,39200.0,71000.0,37000.0,149000.0,HASS
29,Hospitality & Tourism,37800.0,57500.0,35500.0,124000.0,Business
30,Industrial Engineering,57700.0,94700.0,57100.0,173000.0,STEM
31,Information Technology (IT),49100.0,74800.0,44500.0,129000.0,STEM
32,Interior Design,36100.0,53200.0,35700.0,107000.0,HASS
33,International Relations,40900.0,80900.0,38200.0,157000.0,HASS
34,Journalism,35600.0,66700.0,38400.0,145000.0,HASS
35,Management Information Systems (MIS),49200.0,82300.0,45300.0,146000.0,STEM
36,Marketing,40800.0,79600.0,42100.0,175000.0,Business
37,Math,45400.0,92400.0,45200.0,183000.0,STEM
38,Mechanical Engineering,57900.0,93600.0,63700.0,163000.0,STEM
39,Music,35900.0,55000.0,26700.0,134000.0,HASS
40,Nursing,54200.0,67000.0,47600.0,98300.0,Business
41,Nutrition,39900.0,55300.0,33900.0,99200.0,HASS
42,Philosophy,39900.0,81200.0,35500.0,168000.0,HASS
43,Physician Assistant,74300.0,91700.0,66400.0,124000.0,STEM
44,Physics,50300.0,97300.0,56000.0,178000.0,STEM
45,Political Science,40800.0,78200.0,41200.0,168000.0,HASS
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS

## Find College Major with Highest Starting Salaries

In [15]:
clean_df['Starting Median Salary'].max()

74300.0

In [16]:
clean_df['Starting Median Salary'].idxmax()

43

In [17]:
clean_df['Starting Median Salary'][clean_df['Starting Median Salary'].idxmax()]

74300.0

In [18]:
clean_df['Undergraduate Major'][43]

'Physician Assistant'

In [19]:
clean_df['Undergraduate Major'].loc[43]

'Physician Assistant'

In [20]:
clean_df['Undergraduate Major'][clean_df['Starting Median Salary'].idxmax()]

'Physician Assistant'

In [21]:
clean_df.head(2)

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,57700.0,101000.0,64300.0,161000.0,STEM

In [22]:
clean_df.loc[1]

Undergraduate Major                  Aerospace Engineering
Starting Median Salary                             57700.0
Mid-Career Median Salary                          101000.0
Mid-Career 10th Percentile Salary                  64300.0
Mid-Career 90th Percentile Salary                 161000.0
Group                                                 STEM
Name: 1, dtype: object

### What college major has the highest mid-career salary? How much do graduates with this major earn? (Mid-career is defined as having 10+ years of experience).

In [23]:
clean_df['Mid-Career Median Salary'].idxmax()

8

In [24]:
clean_df['Mid-Career Median Salary'].max()

107000.0

In [25]:
clean_df.loc[clean_df['Mid-Career Median Salary'].idxmax()]

Undergraduate Major                  Chemical Engineering
Starting Median Salary                            63200.0
Mid-Career Median Salary                         107000.0
Mid-Career 10th Percentile Salary                 71900.0
Mid-Career 90th Percentile Salary                194000.0
Group                                                STEM
Name: 8, dtype: object

In [26]:
pd.DataFrame(clean_df.loc[clean_df['Mid-Career Median Salary'].idxmax()])

                                                      8
Undergraduate Major                Chemical Engineering
Starting Median Salary                          63200.0
Mid-Career Median Salary                       107000.0
Mid-Career 10th Percentile Salary               71900.0
Mid-Career 90th Percentile Salary              194000.0
Group                                              STEM

In [27]:
clean_df.loc[[clean_df['Mid-Career Median Salary'].idxmax()]]

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
8,Chemical Engineering,63200.0,107000.0,71900.0,194000.0,STEM

In [28]:
clean_df[['Undergraduate Major','Mid-Career Median Salary']].loc[[clean_df['Mid-Career Median Salary'].idxmax()]]

    Undergraduate Major  Mid-Career Median Salary
8  Chemical Engineering                  107000.0

In [29]:
pd.DataFrame(clean_df[['Undergraduate Major','Mid-Career Median Salary']].loc[clean_df['Mid-Career Median Salary'].idxmax()])

                                             8
Undergraduate Major       Chemical Engineering
Mid-Career Median Salary              107000.0

In [30]:
# to print multiple columns
clean_df[['Undergraduate Major','Mid-Career Median Salary']].head(2)

     Undergraduate Major  Mid-Career Median Salary
0             Accounting                   77100.0
1  Aerospace Engineering                  101000.0


### Which college major has the lowest starting salary and how much do graduates earn after university?

In [31]:
clean_df[['Undergraduate Major','Starting Median Salary']].loc[clean_df['Starting Median Salary'].idxmin()]

Undergraduate Major       Spanish
Starting Median Salary    34000.0
Name: 49, dtype: object

In [32]:
print('For lowest starting salary of Undergraduates.')
print('min salary is: ',clean_df['Starting Median Salary'].min())
print('index is: ',clean_df['Starting Median Salary'].idxmin())
clean_df['Undergraduate Major'].loc[clean_df['Starting Median Salary'].idxmin()]

For lowest starting salary of Undergraduates.
min salary is:  34000.0
index is:  49

'Spanish'

In [33]:
print('Lowest salary for Graduates. ')
print('min salary is: ',clean_df['Mid-Career Median Salary'].min())
print('index is: ',clean_df['Mid-Career Median Salary'].idxmin())
clean_df['Undergraduate Major'].loc[clean_df['Mid-Career Median Salary'].idxmin()]

Lowest salary for Graduates.
min salary is:  52000.0
index is:  18

'Education'

In [34]:
print('Lowest Salary for Undergraduates:')
clean_df[['Undergraduate Major','Starting Median Salary']].loc[[clean_df['Starting Median Salary'].idxmin()]]

Lowest Salary for Undergraduates:

   Undergraduate Major  Starting Median Salary
49             Spanish                 34000.0

In [35]:
print('Lowest Salary for Graduates:')
clean_df[['Undergraduate Major','Starting Median Salary']].loc[[clean_df['Starting Median Salary'].idxmin()]]

Lowest Salary for Graduates:

   Undergraduate Major  Starting Median Salary
49             Spanish                 34000.0

## Which college major has the lowest mid-career salary and how much can people expect to earn with this degree?

In [36]:
degree= clean_df['Undergraduate Major'].loc[clean_df['Mid-Career Median Salary'].idxmin()]
max_salary= clean_df[['Mid-Career 90th Percentile Salary']].loc[clean_df['Undergraduate Major']==degree]
max_salary

    Mid-Career 90th Percentile Salary
18                           102000.0

In [37]:
clean_df[clean_df['Undergraduate Major']==degree]

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
18,Education,34900.0,52000.0,29300.0,102000.0,HASS

In [38]:
print('College Major with lowest salary: ',degree)
print(f"People can expect from {degree} expect upto:"
    f"{max_salary['Mid-Career 90th Percentile Salary'].max()}")

College Major with lowest salary:  Education
People can expect from Education expect upto:102000.0

In [39]:
clean_df[['Undergraduate Major','Starting Median Salary']].loc[clean_df['Undergraduate Major']=='Accounting']

  Undergraduate Major  Starting Median Salary
0          Accounting                 46000.0

In [40]:
clean_df.loc[clean_df['Undergraduate Major']=='Accounting',['Undergraduate Major','Starting Median Salary']]

  Undergraduate Major  Starting Median Salary
0          Accounting                 46000.0

## Which degrees have the highest starting salaries?

In [41]:
clean_df['Undergraduate Major'].loc[clean_df['Starting Median Salary'].idxmax()]

'Physician Assistant'

## Which majors have the lowest earnings after college?

In [42]:
clean_df['Undergraduate Major'].loc[clean_df['Mid-Career Median Salary'].idxmax()]

'Chemical Engineering'

## Which degrees have the highest earning potential?

In [43]:
clean_df['Undergraduate Major'].loc[clean_df['Mid-Career 90th Percentile Salary'].idxmax()]

'Economics'

In [44]:
clean_df.sort_values('Mid-Career 90th Percentile Salary',ascending=False).head()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
17,Economics,50100.0,98600.0,50600.0,210000.0,Business
22,Finance,47900.0,88300.0,47200.0,195000.0,Business
8,Chemical Engineering,63200.0,107000.0,71900.0,194000.0,STEM
37,Math,45400.0,92400.0,45200.0,183000.0,STEM
44,Physics,50300.0,97300.0,56000.0,178000.0,STEM

In [45]:
clean_df[['Undergraduate Major','Mid-Career 90th Percentile Salary']].sort_values('Mid-Career 90th Percentile Salary',ascending=False).head()

     Undergraduate Major  Mid-Career 90th Percentile Salary
17             Economics                           210000.0
22               Finance                           195000.0
8   Chemical Engineering                           194000.0
37                  Math                           183000.0
44               Physics                           178000.0

## Do business, STEM (Science, Technology, Engineering, Mathematics) or HASS (Humanities, Arts, Social Science) degrees earn more on average?

In [46]:
clean_df.groupby('Group').count()[['Undergraduate Major','Mid-Career 90th Percentile Salary']]

          Undergraduate Major  Mid-Career 90th Percentile Salary
Group
Business                   12                                 12
HASS                       22                                 22
STEM                       16                                 16

In [47]:
pd.options.display.float_format= '{:,.2f}'.format
clean_df.drop(columns='Undergraduate Major',inplace=False).groupby('Group').mean()

,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,
Business,"44,633.33","75,083.33","43,566.67","147,525.00"
HASS,"37,186.36","62,968.18","34,145.45","129,363.64"
STEM,"53,862.50","90,812.50","56,025.00","157,625.00"

In [48]:
group_df= clean_df.drop(columns='Undergraduate Major').groupby('Group').mean()
group_df

,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,
Business,"44,633.33","75,083.33","43,566.67","147,525.00"
HASS,"37,186.36","62,968.18","34,145.45","129,363.64"
STEM,"53,862.50","90,812.50","56,025.00","157,625.00"

In [49]:
group_df.mean(axis=1)

Group
Business   77,702.08
HASS       65,915.91
STEM       89,581.25
dtype: float64

In [50]:
pd.DataFrame(group_df.mean(axis=1),columns=['row_avg'])

           row_avg
Group
Business 77,702.08
HASS     65,915.91
STEM     89,581.25

In [51]:
clean_df.head()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,"46,000.00","77,100.00","42,200.00","152,000.00",Business
1,Aerospace Engineering,"57,700.00","101,000.00","64,300.00","161,000.00",STEM
2,Agriculture,"42,600.00","71,900.00","36,300.00","150,000.00",Business
3,Anthropology,"36,800.00","61,500.00","33,800.00","138,000.00",HASS
4,Architecture,"41,600.00","76,800.00","50,600.00","136,000.00",Business